In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
import os
print(os.listdir('./Data/'))

['test1_activity.csv', 'test1_combat.csv', 'test1_payment.csv', 'test1_pledge.csv', 'test1_trade.csv', 'test2_activity.csv', 'test2_combat.csv', 'test2_payment.csv', 'test2_pledge.csv', 'test2_trade.csv', 'train_activity.csv', 'train_combat.csv', 'train_label.csv', 'train_payment.csv', 'train_pledge.csv', 'train_trade.csv']

In [3]:
tr_trade = pd.read_csv('./Data/train_trade.csv')
t1_trade = pd.read_csv('./Data/test1_trade.csv')
t2_trade = pd.read_csv('./Data/test2_trade.csv')
tr_label = pd.read_csv('./Data/train_label.csv')

In [4]:
tr_label.shape

(40000, 3)

In [5]:
tr_label.head()

   acc_id  survival_time  amount_spent
0   27835             64      0.002559
1   12351             64      0.120154
2  125437             55      0.182593
3  104483             64      0.016241
4    4704             20      0.226396

In [6]:
print(tr_trade.shape)
tr_trade.head()

(2245196, 11)

,day,time,type,server,source_acc_id,source_char_id,target_acc_id,target_char_id,item_type,item_amount,item_price
0,1,21:40:09,0,bd,115641,202802,42143,197398,etc,2.678249e-07,0.001859
1,1,13:08:52,1,ah,104546,293593,41270,224395,etc,9.373872e-06,NaN
2,1,21:01:48,1,au,84624,107496,33916,312167,adena,2.249729e+00,NaN
3,1,14:37:50,1,ar,78411,226143,80350,34764,adena,6.695623e-03,NaN
4,1,20:32:00,0,ay,50284,44100,17523,276351,etc,5.356498e-08,0.037402

In [7]:
print(t1_trade.shape)
t1_trade.head()

(968482, 11)

,day,time,type,server,source_acc_id,source_char_id,target_acc_id,target_char_id,item_type,item_amount,item_price
0,1,13:55:58,1,ae,81831,94502,33305,184638,adena,7.858491e-01,NaN
1,1,20:49:42,0,aw,122462,5995,66357,160973,enchant_scroll,1.071300e-07,0.104333
2,1,17:22:35,0,az,41397,292641,18634,294647,etc,4.285199e-07,0.000902
3,1,18:47:10,1,ai,87547,263923,52706,144370,adena,2.062252e+00,NaN
4,1,02:53:47,0,ax,41352,183609,53276,215712,enchant_scroll,5.356498e-08,0.018018

In [8]:
print(t2_trade.shape)
t2_trade.head()

(906314, 11)

,day,time,type,server,source_acc_id,source_char_id,target_acc_id,target_char_id,item_type,item_amount,item_price
0,1,20:12:22,0,aa,11089,95679,60199,385544,etc,5.329716e-06,0.018235
1,1,20:10:21,1,ar,46124,140784,94931,127804,accessory,5.356498e-08,NaN
2,1,09:40:36,1,ae,52645,88053,54931,160613,weapon,2.678249e-08,NaN
3,1,22:53:14,1,an,102324,145058,70295,252016,adena,2.785379e-01,NaN
4,1,23:18:32,1,aj,91265,268489,21523,353515,etc,2.678249e-08,NaN

In [9]:
tr_trade['hr'] = tr_trade.time.str[:2]
t1_trade['hr'] = t1_trade.time.str[:2]
t2_trade['hr'] = t2_trade.time.str[:2]

In [10]:
tr_trade.head()

,day,time,type,server,source_acc_id,source_char_id,target_acc_id,target_char_id,item_type,item_amount,item_price,hr
0,1,21:40:09,0,bd,115641,202802,42143,197398,etc,2.678249e-07,0.001859,21
1,1,13:08:52,1,ah,104546,293593,41270,224395,etc,9.373872e-06,NaN,13
2,1,21:01:48,1,au,84624,107496,33916,312167,adena,2.249729e+00,NaN,21
3,1,14:37:50,1,ar,78411,226143,80350,34764,adena,6.695623e-03,NaN,14
4,1,20:32:00,0,ay,50284,44100,17523,276351,etc,5.356498e-08,0.037402,20

In [11]:
tr_trade = tr_trade.drop('time', axis = 1)
t1_trade = t1_trade.drop('time', axis = 1)
t2_trade = t2_trade.drop('time', axis = 1)

In [12]:
# for item in tr_trade.item_type.unique():
#     print(item, '\t', tr_trade.loc[tr_trade.item_type == item, 'hr'].count(), '\t', tr_trade.loc[(tr_trade.item_type == item)&(tr_trade.item_price.isnull()),'hr'].count())

In [13]:
# for item in tr_trade.item_type.unique():
#     loc = tr_trade.loc[tr_trade.item_type == item, 'item_amount']
#     print(item, '\t', loc.min(), '\t', loc.max())

In [14]:
tr_trade['source_count'] = None
t1_trade['source_count'] = None
t2_trade['source_count'] = None

tr_trade['target_count'] = None
t1_trade['target_count'] = None
t2_trade['target_count'] = None

In [15]:
for source_acc in tr_trade.source_acc_id.unique():
    tr_trade.loc[tr_trade.source_acc_id == source_acc, 'source_count'] = tr_trade.loc[tr_trade.source_acc_id == source_acc, 'item_type'].count()

for source_acc in t1_trade.source_acc_id.unique():
    t1_trade.loc[t1_trade.source_acc_id == source_acc, 'source_count'] = t1_trade.loc[t1_trade.source_acc_id == source_acc, 'item_type'].count()

for source_acc in t2_trade.source_acc_id.unique():
    t2_trade.loc[t2_trade.source_acc_id == source_acc, 'source_count'] = t2_trade.loc[t2_trade.source_acc_id == source_acc, 'item_type'].count()

In [16]:
for target_acc in tr_trade.target_acc_id.unique():
    tr_trade.loc[tr_trade.target_acc_id == target_acc, 'target_count'] = tr_trade.loc[tr_trade.target_acc_id == target_acc, 'item_type'].count()

for target_acc in t1_trade.target_acc_id.unique():
    t1_trade.loc[t1_trade.target_acc_id == target_acc, 'target_count'] = t1_trade.loc[t1_trade.target_acc_id == target_acc, 'item_type'].count()

for target_acc in t2_trade.target_acc_id.unique():
    t2_trade.loc[t2_trade.target_acc_id == target_acc, 'target_count'] = t2_trade.loc[t2_trade.target_acc_id == target_acc, 'item_type'].count()

In [ ]:
tr_trade = pd.

In [53]:
tr_source_trade = tr_trade
tr_target_trade = tr_trade
        
tr_source_trade = tr_source_trade.drop(['target_acc_id', 'source_char_id', 'target_char_id', 'target_count'], axis = 1)
tr_target_trade = tr_target_trade.drop(['source_acc_id', 'target_char_id', 'source_char_id', 'source_count'], axis = 1)

t1_source_trade = t1_trade
t1_target_trade = t1_trade

t1_source_trade = t1_source_trade.drop(['target_acc_id', 'source_char_id', 'target_char_id', 'target_count'], axis = 1)
t1_target_trade = t1_target_trade.drop(['source_acc_id', 'target_char_id', 'source_char_id', 'source_count'], axis = 1)

t2_source_trade = t2_trade
t2_target_trade = t2_trade

t2_source_trade = t2_source_trade.drop(['target_acc_id', 'source_char_id', 'target_char_id', 'target_count'], axis = 1)
t2_target_trade = t2_target_trade.drop(['source_acc_id', 'target_char_id', 'source_char_id', 'source_count'], axis = 1)

In [54]:
tr_target_trade = tr_target_trade.rename(columns = {'target_acc_id' : 'acc_id', 'target_count' : 'count'})
t1_target_trade = t1_target_trade.rename(columns = {'target_acc_id' : 'acc_id', 'target_count' : 'count'})
t2_target_trade = t2_target_trade.rename(columns = {'target_acc_id' : 'acc_id', 'target_count' : 'count'})

In [55]:
tr_source_trade = tr_source_trade.rename(columns = {'source_acc_id' : 'acc_id', 'source_count' : 'count'})
t1_source_trade = t1_source_trade.rename(columns = {'source_acc_id' : 'acc_id', 'source_count' : 'count'})
t2_source_trade = t2_source_trade.rename(columns = {'source_acc_id' : 'acc_id', 'source_count' : 'count'})

In [56]:
tr_source_trade = tr_source_trade.drop(['day', 'type', 'server', 'item_price', 'item_amount', 'hr'], axis = 1)
t1_source_trade = t1_source_trade.drop(['day', 'type', 'server', 'item_price', 'item_amount', 'hr'], axis = 1)
t2_source_trade = t2_source_trade.drop(['day', 'type', 'server', 'item_price', 'item_amount', 'hr'], axis = 1)

In [57]:
tr_target_trade = tr_target_trade.drop(['day', 'type', 'server', 'item_price', 'item_amount', 'hr'], axis = 1)
t1_target_trade = t1_target_trade.drop(['day', 'type', 'server', 'item_price', 'item_amount', 'hr'], axis = 1)
t2_target_trade = t2_target_trade.drop(['day', 'type', 'server', 'item_price', 'item_amount', 'hr'], axis = 1)

In [58]:
tr_source_trade.to_csv('./input/EDA(1)_train_source_trade.csv', index = False)
tr_target_trade.to_csv('./input/EDA(1)_train_target_trade.csv', index = False)
t1_source_trade.to_csv('./input/EDA(1)_test1_source_trade.csv', index = False)
t1_target_trade.to_csv('./input/EDA(1)_test1_target_trade.csv', index = False)
t2_source_trade.to_csv('./input/EDA(1)_train_source_trade.csv', index = False)
t2_target_trade.to_csv('./input/EDA(1)_train_target_trade.csv', index = False)

In [59]:
tr_source_trade.head()

   acc_id item_type  count
0  115641       etc    774
1  104546       etc    635
2   84624     adena     96
3   78411     adena    126
4   50284       etc    351

In [60]:
tr_source_trade.shape[0]

2245196